{
  "source": "youtube_caption",
  "language": "en",
  "full_text": "with OpenAI, you know, lots of people are already using it uh in the private world. Uh so I I consider this like you start playing with it, then you start working with it and from there you start innovating with it. AI is not new to Phillips. Uh we have AI embedded in in many many of our products. So with that we also have highly specialized AI teams but most of that is traditional AI machine learning. So we also felt it's it's really the time to to elevate AI literacy across all of the 70,000 employees and make sure that everybody knows how to use AI and that's where we started the journey with with open AI uh a few months ago and to deploy that among few thousand users to see like how will they adopt this and how will they get the benefits from uh from using AI in the day-to-day practices. I personally trained all the XCO members because they need to use this tool. When the word came out that we were deploying enterprise uh chat GPT, people wanted it and we have limited licenses. So we said sign in for the summer challenge. come with your brightest idea on where AI could play a role for the company and the best ones will win a license, you know, and that's how you see that across the organization, you're going to build this up and see um how people can make better use of AI. I was in a hospital where they had an emergency case coming in there and and and the clinician spent 15 minutes in the cat lab to save a human's life and after that they have to do an equivalent amount of administration. Well, he could save two lives in that in that same time. Our healthcare practitioners are spending way too much time on administrative burden. How can we take that away from them and give them time back to spend with the patient? And from there, let let's go for the moon. Let's go for Mars. Let's go beyond all of that there uh to make sure that we uh use in the full potential.",
  "segments": [
    {
      "start": 0.16,
      "end": 4.72,
      "text": "with OpenAI, you know, lots of people"
    },
    {
      "start": 2.72,
      "end": 6.96,
      "text": "are already using it uh in the private"
    },
    {
      "start": 4.72,
      "end": 8.48,
      "text": "world. Uh so I I consider this like you"
    },
    {
      "start": 6.96,
      "end": 9.92,
      "text": "start playing with it, then you start"
    },
    {
      "start": 8.48,
      "end": 13.64,
      "text": "working with it and from there you start"
    },
    {
      "start": 9.92,
      "end": 13.64,
      "text": "innovating with it."
    },
    {
      "start": 21.84,
      "end": 26.4,
      "text": "AI is not new to Phillips. Uh we have AI"
    },
    {
      "start": 24.56,
      "end": 28.08,
      "text": "embedded in in many many of our"
    },
    {
      "start": 26.4,
      "end": 30.96,
      "text": "products. So with that we also have"
    },
    {
      "start": 28.08,
      "end": 33.52,
      "text": "highly specialized AI teams but most of"
    },
    {
      "start": 30.96,
      "end": 35.36,
      "text": "that is traditional AI machine learning."
    },
    {
      "start": 33.52,
      "end": 37.84,
      "text": "So we also felt it's it's really the"
    },
    {
      "start": 35.36,
      "end": 39.84,
      "text": "time to to elevate AI literacy across"
    },
    {
      "start": 37.84,
      "end": 42.0,
      "text": "all of the 70,000 employees and make"
    },
    {
      "start": 39.84,
      "end": 43.6,
      "text": "sure that everybody knows how to use AI"
    },
    {
      "start": 42.0,
      "end": 46.4,
      "text": "and that's where we started the journey"
    },
    {
      "start": 43.6,
      "end": 48.32,
      "text": "with with open AI uh a few months ago"
    },
    {
      "start": 46.4,
      "end": 50.48,
      "text": "and to deploy that among few thousand"
    },
    {
      "start": 48.32,
      "end": 52.64,
      "text": "users to see like how will they adopt"
    },
    {
      "start": 50.48,
      "end": 54.88,
      "text": "this and how will they get the benefits"
    },
    {
      "start": 52.64,
      "end": 57.88,
      "text": "from uh from using AI in the day-to-day"
    },
    {
      "start": 54.88,
      "end": 57.88,
      "text": "practices."
    },
    {
      "start": 59.76,
      "end": 64.32,
      "text": "I personally trained all the XCO members"
    },
    {
      "start": 61.92,
      "end": 66.0,
      "text": "because they need to use this tool. When"
    },
    {
      "start": 64.32,
      "end": 69.44,
      "text": "the word came out that we were deploying"
    },
    {
      "start": 66.0,
      "end": 71.92,
      "text": "enterprise uh chat GPT, people wanted it"
    },
    {
      "start": 69.44,
      "end": 73.52,
      "text": "and we have limited licenses. So we said"
    },
    {
      "start": 71.92,
      "end": 75.2,
      "text": "sign in for the summer challenge. come"
    },
    {
      "start": 73.52,
      "end": 76.88,
      "text": "with your brightest idea on where AI"
    },
    {
      "start": 75.2,
      "end": 79.12,
      "text": "could play a role for the company and"
    },
    {
      "start": 76.88,
      "end": 80.88,
      "text": "the best ones will win a license, you"
    },
    {
      "start": 79.12,
      "end": 82.56,
      "text": "know, and that's how you see that across"
    },
    {
      "start": 80.88,
      "end": 85.68,
      "text": "the organization, you're going to build"
    },
    {
      "start": 82.56,
      "end": 89.32,
      "text": "this up and see um how people can make"
    },
    {
      "start": 85.68,
      "end": 89.32,
      "text": "better use of AI."
    },
    {
      "start": 90.96,
      "end": 94.64,
      "text": "I was in a hospital where they had an"
    },
    {
      "start": 92.64,
      "end": 97.52,
      "text": "emergency case coming in there and and"
    },
    {
      "start": 94.64,
      "end": 100.64,
      "text": "and the clinician spent 15 minutes in"
    },
    {
      "start": 97.52,
      "end": 102.48,
      "text": "the cat lab to save a human's life and"
    },
    {
      "start": 100.64,
      "end": 104.96,
      "text": "after that they have to do an equivalent"
    },
    {
      "start": 102.48,
      "end": 106.64,
      "text": "amount of administration. Well, he could"
    },
    {
      "start": 104.96,
      "end": 108.56,
      "text": "save two lives in that in that same"
    },
    {
      "start": 106.64,
      "end": 110.48,
      "text": "time. Our healthcare practitioners are"
    },
    {
      "start": 108.56,
      "end": 112.64,
      "text": "spending way too much time on"
    },
    {
      "start": 110.48,
      "end": 114.32,
      "text": "administrative burden. How can we take"
    },
    {
      "start": 112.64,
      "end": 116.48,
      "text": "that away from them and give them time"
    },
    {
      "start": 114.32,
      "end": 118.16,
      "text": "back to spend with the patient? And from"
    },
    {
      "start": 116.48,
      "end": 120.0,
      "text": "there, let let's go for the moon. Let's"
    },
    {
      "start": 118.16,
      "end": 122.24,
      "text": "go for Mars. Let's go beyond all of that"
    },
    {
      "start": 120.0,
      "end": 125.64,
      "text": "there uh to make sure that we uh use in"
    },
    {
      "start": 122.24,
      "end": 125.64,
      "text": "the full potential."
    }
  ],
  "word_count": 369,
  "fetched_at": "2025-12-21T02:19:53.258285Z"
}